Terraform plan for __ibo__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_storage_bucket.order_file_bucket will be created
  + resource "google_storage_bucket" "order_file_bucket" {
      + bucket_policy_only          = (known after apply)
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "ASIA"
      + name                        = "challan-files-prod"
      + project                     = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Provider helm is undefined

  on istio_telemetry_gke.tf line 27, in module "istio_telemetry_proxy":
  27:     helm = helm.gke

Module module.istio_telemetry_proxy does not declare a provider named helm.
If you wish to specify a provider configuration for the module, add an entry
for helm in the required_providers block within the module.

Warning: Provider kubernetes is undefined

  on jumpbox.tf line 3, in module "jumpbox":
   3:     kubernetes = kubernetes.gke

Module module.jumpbox does not declare a provider named kubernetes.
If you wish to specify a provider configuration for the module, add an entry
for kubernetes in the required_providers block within the module.
```
</details>

:memo: Plan generated in [Terraform #316](https://github.com/ebomart/commerce-infrastructure/actions/runs/1411693430)